questions = [
    {
        'text': 'Какой климат вам ближе?',
        'options': [
            {'text': 'Лёд и бескрайние полярные просторы'},
            {'text': 'Густая тайга с мохнатым подлеском'},
            {'text': 'Жаркая африканская саванна'},
            {'text': 'Высокие ровные равнины и кустарники'}
        ]
    },
    {
        'text': 'Как вы предпочитаете начинать день?',
        'options': [
            {'text': 'Просыпаюсь до восхода и сразу в бой!'},
            {'text': 'Делаю растяжку и неспешно потягиваюсь.'},
            {'text': 'С чашкой кофе проверяю почту в одиночку.'},
            {'text': 'Ещё — пару часов сладкого сна.'}
        ]
    },
    {
        'text': 'В компании друзей вы…',
        'options': [
            {'text': 'Всегда лидер: направляю, организую, веду за собой.'},
            {'text': 'Наблюдатель: стараюсь понять, кто на что способен.'},
            {'text': 'Шутник: поднимаю настроение громким «смехом».'},
            {'text': 'Спокойный союзник: надёжно прикрою тыл.'}
        ]
    },
    {
        'text': 'Ваш идеальный путь решения проблемы…',
        'options': [
            {'text': 'Моментально атаковать: «вперед и решать!»'},
            {'text': 'Подкрасться бесшумно и выждать момент.'},
            {'text': 'Собрать команду и совместно разрулить.'},
            {'text': 'Проанализировать спокойно и выбрать оптимальный шаг.'}
        ]
    },
    {
        'text': 'Сколько часов в сутки вам достаточно для отдыха?',
        'options': [
            {'text': '2–4 часа (главное — не стоять на месте)'},
            {'text': '8–10 часов (обожаю спать в уединении)'},
            {'text': '4–6 часов (баланс «сон–активность»)'},
            {'text': 'Как получится — я и днём, и ночью готов к действию'}
        ]
    },
    {
        'text': 'В выборе рациона вы…',
        'options': [
            {'text': 'Чистый хищник: люблю мясо и рыбу.'},
            {'text': 'Всёядный гурман: кайфую и от ягод, и от мяса.'},
            {'text': 'Вегетарианец или веган: растения — моё всё.'},
            {'text': 'Экспериментатор: любую экзотику попробую.'}
        ]
    },
    {
        'text': 'Если вы видите препятствие, вы…',
        'options': [
            {'text': 'Перелезаете через него без лишних слов.'},
            {'text': 'Обходите стороной, чтобы не тратить энергию.'},
            {'text': 'Лидируете и зовёте за собой всех друзей.'},
            {'text': 'Спокойно оцениваете и продумываете обходной маршрут.'}
        ]
    }
]
